<?php
/**
 * 省份列表。来自OAuth 1.0接口：
 * @see http://api.t.sina.com.cn/provinces.json
 * @author yaoying
 * @version $Id: conv_2_getProvinces.class.php 1011 2012-09-21 10:34:29Z yaoying $
 *
 */
if (!defined('IS_IN_XWB_PLUGIN')) {
	exit('ACCESS DENIED');
}
class conv_2_getProvinces extends conv_2_base{
	
	/**
	 * 
	 * @param array $data
	 * @param array $param 参数，必填key有：
	 * [string] body 要提取的body
	 * @return array
	 */
	function convert(){
		
return array (
  'provinces' => 
  array (
    0 => 
    array (
      'id' => 11,
      'name' => '北京',
      'citys' => 
      array (
        0 => 
        array (
          1 => '东城区',
        ),
        1 => 
        array (
          2 => '西城区',
        ),
        2 => 
        array (
          3 => '崇文区',
        ),
        3 => 
        array (
          4 => '宣武区',
        ),
        4 => 
        array (
          5 => '朝阳区',
        ),
        5 => 
        array (
          6 => '丰台区',
        ),
        6 => 
        array (
          7 => '石景山区',
        ),
        7 => 
        array (
          8 => '海淀区',
        ),
        8 => 
        array (
          9 => '门头沟区',
        ),
        9 => 
        array (
          11 => '房山区',
        ),
        10 => 
        array (
          12 => '通州区',
        ),
        11 => 
        array (
          13 => '顺义区',
        ),
        12 => 
        array (
          14 => '昌平区',
        ),
        13 => 
        array (
          15 => '大兴区',
        ),
        14 => 
        array (
          16 => '怀柔区',
        ),
        15 => 
        array (
          17 => '平谷区',
        ),
        16 => 
        array (
          28 => '密云县',
        ),
        17 => 
        array (
          29 => '延庆县',
        ),
      ),
    ),
    1 => 
    array (
      'id' => 12,
      'name' => '天津',
      'citys' => 
      array (
        0 => 
        array (
          1 => '和平区',
        ),
        1 => 
        array (
          2 => '河东区',
        ),
        2 => 
        array (
          3 => '河西区',
        ),
        3 => 
        array (
          4 => '南开区',
        ),
        4 => 
        array (
          5 => '河北区',
        ),
        5 => 
        array (
          6 => '红桥区',
        ),
        6 => 
        array (
          7 => '塘沽区',
        ),
        7 => 
        array (
          8 => '汉沽区',
        ),
        8 => 
        array (
          9 => '大港区',
        ),
        9 => 
        array (
          10 => '东丽区',
        ),
        10 => 
        array (
          11 => '西青区',
        ),
        11 => 
        array (
          12 => '津南区',
        ),
        12 => 
        array (
          13 => '北辰区',
        ),
        13 => 
        array (
          14 => '武清区',
        ),
        14 => 
        array (
          15 => '宝坻区',
        ),
        15 => 
        array (
          21 => '宁河县',
        ),
        16 => 
        array (
          23 => '静海县',
        ),
        17 => 
        array (
          25 => '蓟县',
        ),
      ),
    ),
    2 => 
    array (
      'id' => 13,
      'name' => '河北',
      'citys' => 
      array (
        0 => 
        array (
          1 => '石家庄',
        ),
        1 => 
        array (
          2 => '唐山',
        ),
        2 => 
        array (
          3 => '秦皇岛',
        ),
        3 => 
        array (
          4 => '邯郸',
        ),
        4 => 
        array (
          5 => '邢台',
        ),
        5 => 
        array (
          6 => '保定',
        ),
        6 => 
        array (
          7 => '张家口',
        ),
        7 => 
        array (
          8 => '承德',
        ),
        8 => 
        array (
          9 => '沧州',
        ),
        9 => 
        array (
          10 => '廊坊',
        ),
        10 => 
        array (
          11 => '衡水',
        ),
      ),
    ),
    3 => 
    array (
      'id' => 14,
      'name' => '山西',
      'citys' => 
      array (
        0 => 
        array (
          1 => '太原',
        ),
        1 => 
        array (
          2 => '大同',
        ),
        2 => 
        array (
          3 => '阳泉',
        ),
        3 => 
        array (
          4 => '长治',
        ),
        4 => 
        array (
          5 => '晋城',
        ),
        5 => 
        array (
          6 => '朔州',
        ),
        6 => 
        array (
          7 => '晋中',
        ),
        7 => 
        array (
          8 => '运城',
        ),
        8 => 
        array (
          9 => '忻州',
        ),
        9 => 
        array (
          10 => '临汾',
        ),
        10 => 
        array (
          23 => '吕梁',
        ),
      ),
    ),
    4 => 
    array (
      'id' => 15,
      'name' => '内蒙古',
      'citys' => 
      array (
        0 => 
        array (
          1 => '呼和浩特',
        ),
        1 => 
        array (
          2 => '包头',
        ),
        2 => 
        array (
          3 => '乌海',
        ),
        3 => 
        array (
          4 => '赤峰',
        ),
        4 => 
        array (
          5 => '通辽',
        ),
        5 => 
        array (
          6 => '鄂尔多斯',
        ),
        6 => 
        array (
          7 => '呼伦贝尔',
        ),
        7 => 
        array (
          22 => '兴安盟',
        ),
        8 => 
        array (
          25 => '锡林郭勒盟',
        ),
        9 => 
        array (
          26 => '乌兰察布盟',
        ),
        10 => 
        array (
          28 => '巴彦淖尔盟',
        ),
        11 => 
        array (
          29 => '阿拉善盟',
        ),
      ),
    ),
    5 => 
    array (
      'id' => 21,
      'name' => '辽宁',
      'citys' => 
      array (
        0 => 
        array (
          1 => '沈阳',
        ),
        1 => 
        array (
          2 => '大连',
        ),
        2 => 
        array (
          3 => '鞍山',
        ),
        3 => 
        array (
          4 => '抚顺',
        ),
        4 => 
        array (
          5 => '本溪',
        ),
        5 => 
        array (
          6 => '丹东',
        ),
        6 => 
        array (
          7 => '锦州',
        ),
        7 => 
        array (
          8 => '营口',
        ),
        8 => 
        array (
          9 => '阜新',
        ),
        9 => 
        array (
          10 => '辽阳',
        ),
        10 => 
        array (
          11 => '盘锦',
        ),
        11 => 
        array (
          12 => '铁岭',
        ),
        12 => 
        array (
          13 => '朝阳',
        ),
        13 => 
        array (
          14 => '葫芦岛',
        ),
      ),
    ),
    6 => 
    array (
      'id' => 22,
      'name' => '吉林',
      'citys' => 
      array (
        0 => 
        array (
          1 => '长春',
        ),
        1 => 
        array (
          2 => '吉林',
        ),
        2 => 
        array (
          3 => '四平',
        ),
        3 => 
        array (
          4 => '辽源',
        ),
        4 => 
        array (
          5 => '通化',
        ),
        5 => 
        array (
          6 => '白山',
        ),
        6 => 
        array (
          7 => '松原',
        ),
        7 => 
        array (
          8 => '白城',
        ),
        8 => 
        array (
          24 => '延边朝鲜族自治州',
        ),
      ),
    ),
    7 => 
    array (
      'id' => 23,
      'name' => '黑龙江',
      'citys' => 
      array (
        0 => 
        array (
          1 => '哈尔滨',
        ),
        1 => 
        array (
          2 => '齐齐哈尔',
        ),
        2 => 
        array (
          3 => '鸡西',
        ),
        3 => 
        array (
          4 => '鹤岗',
        ),
        4 => 
        array (
          5 => '双鸭山',
        ),
        5 => 
        array (
          6 => '大庆',
        ),
        6 => 
        array (
          7 => '伊春',
        ),
        7 => 
        array (
          8 => '佳木斯',
        ),
        8 => 
        array (
          9 => '七台河',
        ),
        9 => 
        array (
          10 => '牡丹江',
        ),
        10 => 
        array (
          11 => '黑河',
        ),
        11 => 
        array (
          12 => '绥化',
        ),
        12 => 
        array (
          27 => '大兴安岭',
        ),
      ),
    ),
    8 => 
    array (
      'id' => 31,
      'name' => '上海',
      'citys' => 
      array (
        0 => 
        array (
          1 => '黄浦区',
        ),
        1 => 
        array (
          3 => '卢湾区',
        ),
        2 => 
        array (
          4 => '徐汇区',
        ),
        3 => 
        array (
          5 => '长宁区',
        ),
        4 => 
        array (
          6 => '静安区',
        ),
        5 => 
        array (
          7 => '普陀区',
        ),
        6 => 
        array (
          8 => '闸北区',
        ),
        7 => 
        array (
          9 => '虹口区',
        ),
        8 => 
        array (
          10 => '杨浦区',
        ),
        9 => 
        array (
          12 => '闵行区',
        ),
        10 => 
        array (
          13 => '宝山区',
        ),
        11 => 
        array (
          14 => '嘉定区',
        ),
        12 => 
        array (
          15 => '浦东新区',
        ),
        13 => 
        array (
          16 => '金山区',
        ),
        14 => 
        array (
          17 => '松江区',
        ),
        15 => 
        array (
          18 => '青浦区',
        ),
        16 => 
        array (
          19 => '南汇区',
        ),
        17 => 
        array (
          20 => '奉贤区',
        ),
        18 => 
        array (
          30 => '崇明县',
        ),
      ),
    ),
    9 => 
    array (
      'id' => 32,
      'name' => '江苏',
      'citys' => 
      array (
        0 => 
        array (
          1 => '南京',
        ),
        1 => 
        array (
          2 => '无锡',
        ),
        2 => 
        array (
          3 => '徐州',
        ),
        3 => 
        array (
          4 => '常州',
        ),
        4 => 
        array (
          5 => '苏州',
        ),
        5 => 
        array (
          6 => '南通',
        ),
        6 => 
        array (
          7 => '连云港',
        ),
        7 => 
        array (
          8 => '淮安',
        ),
        8 => 
        array (
          9 => '盐城',
        ),
        9 => 
        array (
          10 => '扬州',
        ),
        10 => 
        array (
          11 => '镇江',
        ),
        11 => 
        array (
          12 => '泰州',
        ),
        12 => 
        array (
          13 => '宿迁',
        ),
      ),
    ),
    10 => 
    array (
      'id' => 33,
      'name' => '浙江',
      'citys' => 
      array (
        0 => 
        array (
          1 => '杭州',
        ),
        1 => 
        array (
          2 => '宁波',
        ),
        2 => 
        array (
          3 => '温州',
        ),
        3 => 
        array (
          4 => '嘉兴',
        ),
        4 => 
        array (
          5 => '湖州',
        ),
        5 => 
        array (
          6 => '绍兴',
        ),
        6 => 
        array (
          7 => '金华',
        ),
        7 => 
        array (
          8 => '衢州',
        ),
        8 => 
        array (
          9 => '舟山',
        ),
        9 => 
        array (
          10 => '台州',
        ),
        10 => 
        array (
          11 => '丽水',
        ),
      ),
    ),
    11 => 
    array (
      'id' => 34,
      'name' => '安徽',
      'citys' => 
      array (
        0 => 
        array (
          1 => '合肥',
        ),
        1 => 
        array (
          2 => '芜湖',
        ),
        2 => 
        array (
          3 => '蚌埠',
        ),
        3 => 
        array (
          4 => '淮南',
        ),
        4 => 
        array (
          5 => '马鞍山',
        ),
        5 => 
        array (
          6 => '淮北',
        ),
        6 => 
        array (
          7 => '铜陵',
        ),
        7 => 
        array (
          8 => '安庆',
        ),
        8 => 
        array (
          10 => '黄山',
        ),
        9 => 
        array (
          11 => '滁州',
        ),
        10 => 
        array (
          12 => '阜阳',
        ),
        11 => 
        array (
          13 => '宿州',
        ),
        12 => 
        array (
          14 => '巢湖',
        ),
        13 => 
        array (
          15 => '六安',
        ),
        14 => 
        array (
          16 => '亳州',
        ),
        15 => 
        array (
          17 => '池州',
        ),
        16 => 
        array (
          18 => '宣城',
        ),
      ),
    ),
    12 => 
    array (
      'id' => 35,
      'name' => '福建',
      'citys' => 
      array (
        0 => 
        array (
          1 => '福州',
        ),
        1 => 
        array (
          2 => '厦门',
        ),
        2 => 
        array (
          3 => '莆田',
        ),
        3 => 
        array (
          4 => '三明',
        ),
        4 => 
        array (
          5 => '泉州',
        ),
        5 => 
        array (
          6 => '漳州',
        ),
        6 => 
        array (
          7 => '南平',
        ),
        7 => 
        array (
          8 => '龙岩',
        ),
        8 => 
        array (
          9 => '宁德',
        ),
      ),
    ),
    13 => 
    array (
      'id' => 36,
      'name' => '江西',
      'citys' => 
      array (
        0 => 
        array (
          1 => '南昌',
        ),
        1 => 
        array (
          2 => '景德镇',
        ),
        2 => 
        array (
          3 => '萍乡',
        ),
        3 => 
        array (
          4 => '九江',
        ),
        4 => 
        array (
          5 => '新余',
        ),
        5 => 
        array (
          6 => '鹰潭',
        ),
        6 => 
        array (
          7 => '赣州',
        ),
        7 => 
        array (
          8 => '吉安',
        ),
        8 => 
        array (
          9 => '宜春',
        ),
        9 => 
        array (
          10 => '抚州',
        ),
        10 => 
        array (
          11 => '上饶',
        ),
      ),
    ),
    14 => 
    array (
      'id' => 37,
      'name' => '山东',
      'citys' => 
      array (
        0 => 
        array (
          1 => '济南',
        ),
        1 => 
        array (
          2 => '青岛',
        ),
        2 => 
        array (
          3 => '淄博',
        ),
        3 => 
        array (
          4 => '枣庄',
        ),
        4 => 
        array (
          5 => '东营',
        ),
        5 => 
        array (
          6 => '烟台',
        ),
        6 => 
        array (
          7 => '潍坊',
        ),
        7 => 
        array (
          8 => '济宁',
        ),
        8 => 
        array (
          9 => '泰安',
        ),
        9 => 
        array (
          10 => '威海',
        ),
        10 => 
        array (
          11 => '日照',
        ),
        11 => 
        array (
          12 => '莱芜',
        ),
        12 => 
        array (
          13 => '临沂',
        ),
        13 => 
        array (
          14 => '德州',
        ),
        14 => 
        array (
          15 => '聊城',
        ),
        15 => 
        array (
          16 => '滨州',
        ),
        16 => 
        array (
          17 => '菏泽',
        ),
      ),
    ),
    15 => 
    array (
      'id' => 41,
      'name' => '河南',
      'citys' => 
      array (
        0 => 
        array (
          1 => '郑州',
        ),
        1 => 
        array (
          2 => '开封',
        ),
        2 => 
        array (
          3 => '洛阳',
        ),
        3 => 
        array (
          4 => '平顶山',
        ),
        4 => 
        array (
          5 => '安阳',
        ),
        5 => 
        array (
          6 => '鹤壁',
        ),
        6 => 
        array (
          7 => '新乡',
        ),
        7 => 
        array (
          8 => '焦作',
        ),
        8 => 
        array (
          9 => '濮阳',
        ),
        9 => 
        array (
          10 => '许昌',
        ),
        10 => 
        array (
          11 => '漯河',
        ),
        11 => 
        array (
          12 => '三门峡',
        ),
        12 => 
        array (
          13 => '南阳',
        ),
        13 => 
        array (
          14 => '商丘',
        ),
        14 => 
        array (
          15 => '信阳',
        ),
        15 => 
        array (
          16 => '周口',
        ),
        16 => 
        array (
          17 => '驻马店',
        ),
      ),
    ),
    16 => 
    array (
      'id' => 42,
      'name' => '湖北',
      'citys' => 
      array (
        0 => 
        array (
          1 => '武汉',
        ),
        1 => 
        array (
          2 => '黄石',
        ),
        2 => 
        array (
          3 => '十堰',
        ),
        3 => 
        array (
          5 => '宜昌',
        ),
        4 => 
        array (
          6 => '襄樊',
        ),
        5 => 
        array (
          7 => '鄂州',
        ),
        6 => 
        array (
          8 => '荆门',
        ),
        7 => 
        array (
          9 => '孝感',
        ),
        8 => 
        array (
          10 => '荆州',
        ),
        9 => 
        array (
          11 => '黄冈',
        ),
        10 => 
        array (
          12 => '咸宁',
        ),
        11 => 
        array (
          13 => '随州',
        ),
        12 => 
        array (
          28 => '恩施土家族苗族自治州',
        ),
      ),
    ),
    17 => 
    array (
      'id' => 43,
      'name' => '湖南',
      'citys' => 
      array (
        0 => 
        array (
          1 => '长沙',
        ),
        1 => 
        array (
          2 => '株洲',
        ),
        2 => 
        array (
          3 => '湘潭',
        ),
        3 => 
        array (
          4 => '衡阳',
        ),
        4 => 
        array (
          5 => '邵阳',
        ),
        5 => 
        array (
          6 => '岳阳',
        ),
        6 => 
        array (
          7 => '常德',
        ),
        7 => 
        array (
          8 => '张家界',
        ),
        8 => 
        array (
          9 => '益阳',
        ),
        9 => 
        array (
          10 => '郴州',
        ),
        10 => 
        array (
          11 => '永州',
        ),
        11 => 
        array (
          12 => '怀化',
        ),
        12 => 
        array (
          13 => '娄底',
        ),
        13 => 
        array (
          31 => '湘西土家族苗族自治州',
        ),
      ),
    ),
    18 => 
    array (
      'id' => 44,
      'name' => '广东',
      'citys' => 
      array (
        0 => 
        array (
          1 => '广州',
        ),
        1 => 
        array (
          2 => '韶关',
        ),
        2 => 
        array (
          3 => '深圳',
        ),
        3 => 
        array (
          4 => '珠海',
        ),
        4 => 
        array (
          5 => '汕头',
        ),
        5 => 
        array (
          6 => '佛山',
        ),
        6 => 
        array (
          7 => '江门',
        ),
        7 => 
        array (
          8 => '湛江',
        ),
        8 => 
        array (
          9 => '茂名',
        ),
        9 => 
        array (
          12 => '肇庆',
        ),
        10 => 
        array (
          13 => '惠州',
        ),
        11 => 
        array (
          14 => '梅州',
        ),
        12 => 
        array (
          15 => '汕尾',
        ),
        13 => 
        array (
          16 => '河源',
        ),
        14 => 
        array (
          17 => '阳江',
        ),
        15 => 
        array (
          18 => '清远',
        ),
        16 => 
        array (
          19 => '东莞',
        ),
        17 => 
        array (
          20 => '中山',
        ),
        18 => 
        array (
          51 => '潮州',
        ),
        19 => 
        array (
          52 => '揭阳',
        ),
        20 => 
        array (
          53 => '云浮',
        ),
      ),
    ),
    19 => 
    array (
      'id' => 45,
      'name' => '广西',
      'citys' => 
      array (
        0 => 
        array (
          1 => '南宁',
        ),
        1 => 
        array (
          2 => '柳州',
        ),
        2 => 
        array (
          3 => '桂林',
        ),
        3 => 
        array (
          4 => '梧州',
        ),
        4 => 
        array (
          5 => '北海',
        ),
        5 => 
        array (
          6 => '防城港',
        ),
        6 => 
        array (
          7 => '钦州',
        ),
        7 => 
        array (
          8 => '贵港',
        ),
        8 => 
        array (
          9 => '玉林',
        ),
        9 => 
        array (
          10 => '百色',
        ),
        10 => 
        array (
          11 => '贺州',
        ),
        11 => 
        array (
          12 => '河池',
        ),
        12 => 
        array (
          21 => '南宁',
        ),
        13 => 
        array (
          22 => '柳州',
        ),
      ),
    ),
    20 => 
    array (
      'id' => 46,
      'name' => '海南',
      'citys' => 
      array (
        0 => 
        array (
          1 => '海口',
        ),
        1 => 
        array (
          2 => '三亚',
        ),
        2 => 
        array (
          90 => '其他',
        ),
      ),
    ),
    21 => 
    array (
      'id' => 50,
      'name' => '重庆',
      'citys' => 
      array (
        0 => 
        array (
          1 => '万州区',
        ),
        1 => 
        array (
          2 => '涪陵区',
        ),
        2 => 
        array (
          3 => '渝中区',
        ),
        3 => 
        array (
          4 => '大渡口区',
        ),
        4 => 
        array (
          5 => '江北区',
        ),
        5 => 
        array (
          6 => '沙坪坝区',
        ),
        6 => 
        array (
          7 => '九龙坡区',
        ),
        7 => 
        array (
          8 => '南岸区',
        ),
        8 => 
        array (
          9 => '北碚区',
        ),
        9 => 
        array (
          10 => '万盛区',
        ),
        10 => 
        array (
          11 => '双桥区',
        ),
        11 => 
        array (
          12 => '渝北区',
        ),
        12 => 
        array (
          13 => '巴南区',
        ),
        13 => 
        array (
          14 => '黔江区',
        ),
        14 => 
        array (
          15 => '长寿区',
        ),
        15 => 
        array (
          22 => '綦江县',
        ),
        16 => 
        array (
          23 => '潼南县',
        ),
        17 => 
        array (
          24 => '铜梁县',
        ),
        18 => 
        array (
          25 => '大足县',
        ),
        19 => 
        array (
          26 => '荣昌县',
        ),
        20 => 
        array (
          27 => '璧山县',
        ),
        21 => 
        array (
          28 => '梁平县',
        ),
        22 => 
        array (
          29 => '城口县',
        ),
        23 => 
        array (
          30 => '丰都县',
        ),
        24 => 
        array (
          31 => '垫江县',
        ),
        25 => 
        array (
          32 => '武隆县',
        ),
        26 => 
        array (
          33 => '忠县',
        ),
        27 => 
        array (
          34 => '开县',
        ),
        28 => 
        array (
          35 => '云阳县',
        ),
        29 => 
        array (
          36 => '奉节县',
        ),
        30 => 
        array (
          37 => '巫山县',
        ),
        31 => 
        array (
          38 => '巫溪县',
        ),
        32 => 
        array (
          40 => '石柱土家族自治县',
        ),
        33 => 
        array (
          41 => '秀山土家族苗族自治县',
        ),
        34 => 
        array (
          42 => '酉阳土家族苗族自治县',
        ),
        35 => 
        array (
          43 => '彭水苗族土家族自治县',
        ),
        36 => 
        array (
          81 => '江津市',
        ),
        37 => 
        array (
          82 => '合川市',
        ),
        38 => 
        array (
          83 => '永川区',
        ),
        39 => 
        array (
          84 => '南川市',
        ),
      ),
    ),
    22 => 
    array (
      'id' => 51,
      'name' => '四川',
      'citys' => 
      array (
        0 => 
        array (
          1 => '成都',
        ),
        1 => 
        array (
          3 => '自贡',
        ),
        2 => 
        array (
          4 => '攀枝花',
        ),
        3 => 
        array (
          5 => '泸州',
        ),
        4 => 
        array (
          6 => '德阳',
        ),
        5 => 
        array (
          7 => '绵阳',
        ),
        6 => 
        array (
          8 => '广元',
        ),
        7 => 
        array (
          9 => '遂宁',
        ),
        8 => 
        array (
          10 => '内江',
        ),
        9 => 
        array (
          11 => '乐山',
        ),
        10 => 
        array (
          13 => '南充',
        ),
        11 => 
        array (
          14 => '眉山',
        ),
        12 => 
        array (
          15 => '宜宾',
        ),
        13 => 
        array (
          16 => '广安',
        ),
        14 => 
        array (
          17 => '达州',
        ),
        15 => 
        array (
          18 => '雅安',
        ),
        16 => 
        array (
          19 => '巴中',
        ),
        17 => 
        array (
          20 => '资阳',
        ),
        18 => 
        array (
          32 => '阿坝',
        ),
        19 => 
        array (
          33 => '甘孜',
        ),
        20 => 
        array (
          34 => '凉山',
        ),
      ),
    ),
    23 => 
    array (
      'id' => 52,
      'name' => '贵州',
      'citys' => 
      array (
        0 => 
        array (
          1 => '贵阳',
        ),
        1 => 
        array (
          2 => '六盘水',
        ),
        2 => 
        array (
          3 => '遵义',
        ),
        3 => 
        array (
          4 => '安顺',
        ),
        4 => 
        array (
          22 => '铜仁',
        ),
        5 => 
        array (
          23 => '黔西南',
        ),
        6 => 
        array (
          24 => '毕节',
        ),
        7 => 
        array (
          26 => '黔东南',
        ),
        8 => 
        array (
          27 => '黔南',
        ),
      ),
    ),
    24 => 
    array (
      'id' => 53,
      'name' => '云南',
      'citys' => 
      array (
        0 => 
        array (
          1 => '昆明',
        ),
        1 => 
        array (
          3 => '曲靖',
        ),
        2 => 
        array (
          4 => '玉溪',
        ),
        3 => 
        array (
          5 => '保山',
        ),
        4 => 
        array (
          6 => '昭通',
        ),
        5 => 
        array (
          23 => '楚雄',
        ),
        6 => 
        array (
          25 => '红河',
        ),
        7 => 
        array (
          26 => '文山',
        ),
        8 => 
        array (
          27 => '思茅',
        ),
        9 => 
        array (
          28 => '西双版纳',
        ),
        10 => 
        array (
          29 => '大理',
        ),
        11 => 
        array (
          31 => '德宏',
        ),
        12 => 
        array (
          32 => '丽江',
        ),
        13 => 
        array (
          33 => '怒江',
        ),
        14 => 
        array (
          34 => '迪庆',
        ),
        15 => 
        array (
          35 => '临沧',
        ),
      ),
    ),
    25 => 
    array (
      'id' => 54,
      'name' => '西藏',
      'citys' => 
      array (
        0 => 
        array (
          1 => '拉萨',
        ),
        1 => 
        array (
          21 => '昌都',
        ),
        2 => 
        array (
          22 => '山南',
        ),
        3 => 
        array (
          23 => '日喀则',
        ),
        4 => 
        array (
          24 => '那曲',
        ),
        5 => 
        array (
          25 => '阿里',
        ),
        6 => 
        array (
          26 => '林芝',
        ),
      ),
    ),
    26 => 
    array (
      'id' => 61,
      'name' => '陕西',
      'citys' => 
      array (
        0 => 
        array (
          1 => '西安',
        ),
        1 => 
        array (
          2 => '铜川',
        ),
        2 => 
        array (
          3 => '宝鸡',
        ),
        3 => 
        array (
          4 => '咸阳',
        ),
        4 => 
        array (
          5 => '渭南',
        ),
        5 => 
        array (
          6 => '延安',
        ),
        6 => 
        array (
          7 => '汉中',
        ),
        7 => 
        array (
          8 => '榆林',
        ),
        8 => 
        array (
          9 => '安康',
        ),
        9 => 
        array (
          10 => '商洛',
        ),
      ),
    ),
    27 => 
    array (
      'id' => 62,
      'name' => '甘肃',
      'citys' => 
      array (
        0 => 
        array (
          1 => '兰州',
        ),
        1 => 
        array (
          2 => '嘉峪关',
        ),
        2 => 
        array (
          3 => '金昌',
        ),
        3 => 
        array (
          4 => '白银',
        ),
        4 => 
        array (
          5 => '天水',
        ),
        5 => 
        array (
          6 => '武威',
        ),
        6 => 
        array (
          7 => '张掖',
        ),
        7 => 
        array (
          8 => '平凉',
        ),
        8 => 
        array (
          9 => '酒泉',
        ),
        9 => 
        array (
          10 => '庆阳',
        ),
        10 => 
        array (
          24 => '定西',
        ),
        11 => 
        array (
          26 => '陇南',
        ),
        12 => 
        array (
          29 => '临夏',
        ),
        13 => 
        array (
          30 => '甘南',
        ),
      ),
    ),
    28 => 
    array (
      'id' => 63,
      'name' => '青海',
      'citys' => 
      array (
        0 => 
        array (
          1 => '西宁',
        ),
        1 => 
        array (
          21 => '海东',
        ),
        2 => 
        array (
          22 => '海北',
        ),
        3 => 
        array (
          23 => '黄南',
        ),
        4 => 
        array (
          25 => '海南',
        ),
        5 => 
        array (
          26 => '果洛',
        ),
        6 => 
        array (
          27 => '玉树',
        ),
        7 => 
        array (
          28 => '海西',
        ),
      ),
    ),
    29 => 
    array (
      'id' => 64,
      'name' => '宁夏',
      'citys' => 
      array (
        0 => 
        array (
          1 => '银川',
        ),
        1 => 
        array (
          2 => '石嘴山',
        ),
        2 => 
        array (
          3 => '吴忠',
        ),
        3 => 
        array (
          4 => '固原',
        ),
      ),
    ),
    30 => 
    array (
      'id' => 65,
      'name' => '新疆',
      'citys' => 
      array (
        0 => 
        array (
          1 => '乌鲁木齐',
        ),
        1 => 
        array (
          2 => '克拉玛依',
        ),
        2 => 
        array (
          21 => '吐鲁番',
        ),
        3 => 
        array (
          22 => '哈密',
        ),
        4 => 
        array (
          23 => '昌吉',
        ),
        5 => 
        array (
          27 => '博尔塔拉',
        ),
        6 => 
        array (
          28 => '巴音郭楞',
        ),
        7 => 
        array (
          29 => '阿克苏',
        ),
        8 => 
        array (
          30 => '克孜勒苏',
        ),
        9 => 
        array (
          31 => '喀什',
        ),
        10 => 
        array (
          32 => '和田',
        ),
        11 => 
        array (
          40 => '伊犁',
        ),
        12 => 
        array (
          42 => '塔城',
        ),
        13 => 
        array (
          43 => '阿勒泰',
        ),
      ),
    ),
    31 => 
    array (
      'id' => 71,
      'name' => '台湾',
      'citys' => 
      array (
        0 => 
        array (
          1 => '台北',
        ),
        1 => 
        array (
          2 => '高雄',
        ),
        2 => 
        array (
          90 => '其他',
        ),
      ),
    ),
    32 => 
    array (
      'id' => 81,
      'name' => '香港',
      'citys' => 
      array (
        0 => 
        array (
          1 => '香港',
        ),
      ),
    ),
    33 => 
    array (
      'id' => 82,
      'name' => '澳门',
      'citys' => 
      array (
        0 => 
        array (
          1 => '澳门',
        ),
      ),
    ),
    34 => 
    array (
      'id' => 100,
      'name' => '其他',
      'citys' => 
      array (
      ),
    ),
    35 => 
    array (
      'id' => 400,
      'name' => '海外',
      'citys' => 
      array (
        0 => 
        array (
          1 => '美国',
        ),
        1 => 
        array (
          2 => '英国',
        ),
        2 => 
        array (
          3 => '法国',
        ),
        3 => 
        array (
          4 => '俄罗斯',
        ),
        4 => 
        array (
          5 => '加拿大',
        ),
        5 => 
        array (
          6 => '巴西',
        ),
        6 => 
        array (
          7 => '澳大利亚',
        ),
        7 => 
        array (
          8 => '印尼',
        ),
        8 => 
        array (
          9 => '泰国',
        ),
        9 => 
        array (
          10 => '马来西亚',
        ),
        10 => 
        array (
          11 => '新加坡',
        ),
        11 => 
        array (
          12 => '菲律宾',
        ),
        12 => 
        array (
          13 => '越南',
        ),
        13 => 
        array (
          14 => '印度',
        ),
        14 => 
        array (
          15 => '日本',
        ),
        15 => 
        array (
          16 => '其他',
        ),
      ),
    ),
  ),
);



	}
	
}